{
  "intents": [
    {
      "tag": "greetings",
      "patterns": [
        "Dumela",
        "Dumelang",
        "o kae?"
      ],
      "responses": [
        "Dumela, o tsogile",
        "O tleng?",
        "A wa tsoga?",
        "Madume le wena ka koo!"
      ]
    },
    {
      "tag": "greetings_response",
      "patterns": [
        "Ee, ke a tsoga", "Ee, ke tleng"
      ],
      "responses": [
        "Go a itumedisa abo o tsogile sentle,,nka go thusa yang?",
        "Go a lebosega, nka go thusa yang?"
      ]
    },
    {
      "tag": "question",
      "patterns": [
        "O mang",
        "Ke wena mang",
        "O eng",
        "O dira eng",
        "who are you"
      ],
      "responses": [
        "I am Helpr, a chatbot designed to assist you.",
        "Ke nna Helpr, mothusi wa gago wa tsa maranyane.",
        "Helpr here! How can I assist you today?",
        "Helpr fa! ke ka go thusa jang tsatsieno?",
        "I'm an AI chatbot called Helpr, ready to help you with your questions.",
        "Ke roboto ya maranyane e bitswang Helpr, ke ipaakanyeditse go go thusa ka dipotso tsa gago.",
        "Hello! I'm Helpr, your friendly chatbot. How can I help you?",
        "I'm Helpr, the chatbot designed to provide information and assistance."
      ]
    },
    {
      "tag": "khoi-san-greetings",
      "patterns": [
        "Kham",
        "Tanka",
        "Khuab"
      ],
      "responses": [
        "Khai",
        "Gai"
      ]
    },
    {
      "tag": "Introductions",
      "patterns": [
        "KhoiSan ke bo mang", 
        "Khoi San ke bo mang?", 
        "Khoi san ke bo mang?"
      ],
      "responses": [
        "Batho ba Khoisan ke batho ba Afrika Borwa ba boleng \n bo bo tshwanang ka bodumedi le bongwe jwa tlhokomelo",
        "Batho ba Khoisan ke batho ba go dumelwang ele bone \n ba ntlha  go nna banni ba Afrika Borwa"
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "That's helpful", "Thanks a lot!", "OK"],
      "responses": ["Happy to help!", "Any time!", "My pleasure", "No problem"]
    },
    {
      "tag": "marriage",
      "patterns": [
        "tell me about khoisan marriage",
        "more on their marriage"
      ],
      "responses": [
        "Khoi San marriage ceremonies are deeply rooted in tradition, involving rituals that symbolize unity and community.",
        "Elders play a crucial role in Khoi San weddings, offering wisdom and guidance to the newlyweds.",
        "Khoi San couples celebrate their unions with dances, feasts, and symbolic ceremonies reflecting the richness of their culture.",
        "Marriage holds great significance in Khoi San culture, representing the continuation of traditions and the strengthening of community bonds.",
        "Engagement ceremonies in Khoi San culture often include the exchange of symbolic gifts and the involvement of family members in the celebration."
      ]
    },    
    {
      "tag": "death",
      "patterns": [
        "How do khoisan handles death",
        "more on their death"
      ],
      "responses": [
        "Khoi San communities commemorate the passing of loved ones through rituals that honor the departed and support grieving family members.",
        "Mourning practices in Khoi San culture may include communal gatherings, storytelling, and rituals to guide the departed to the afterlife.",
        "Khoi San funerals involve specific rituals, such as ceremonial dances, prayers, and the sharing of memories.",
        "Ancestral remembrance is highly significant in Khoi San traditions, with rituals designed to maintain a connection with those who have passed on.",
        "In Khoi San philosophy, death is often viewed as a transition to another realm, and rituals aim to ensure a peaceful journey for the departed."
      ]
    },
    {
      "tag": "life",
      "patterns": [
        "khoisan life",
        "more on their life"
      ],
      "responses": [
        "Khoi San individuals follow daily routines that involve activities such as hunting, gathering, and communal gatherings.",
        "Balancing traditional and modern aspects, Khoi San communities adapt to changing times while preserving cultural practices.",
        "Nature holds great importance in the daily life of the Khoi San, with a deep connection to the land and its resources.",
        "Different age groups in Khoi San society often have specific roles, contributing to the overall well-being of the community.",
        "Spiritual practices, including storytelling, rituals, and dances, are integrated into the daily life of the Khoi San, fostering a sense of community and connection."
      ]
    },
    {
      "tag": "funny",
      "patterns": [
        "Tell me a joke",
        "another joke",
        "Tell me something funny!",
        "Do you know a joke?",
        "I need cheering up",
        "I am bored",
        "Im bored",
        "Make me laugh"
      ],
      "responses": [
        "Why did the hipster burn his mouth?\n          He drank the coffee before it was cool.",
        "What did the buffalo say when his son left for college\n          Bison.",
        "What did the fish say when he swam into the wall?\n          Dam",
        "Did you hear about the Italian chef who died?\n          He pasta-way",
        "What is red and bad for your teeth?\n          A brick."
      ]
    },
    {
    "tag": "interests",
      "patterns": [
        "What are you?",
        "What do you do?"
      ],
      "responses": [
        "For now I can only chat with you about a few things",
        "Keep you busy I guess, maybe crack some jokes",
        "nothing much for now, but more soon!"
      ]
      },
      {
    "tag": "shutup",
      "patterns": ["Be quiet", "Shut up", "Stop talking", "Enough talking", "Please be quite", "Quiet", "Shhh"],
      "responses": [
        "I am sorry to disturb you",
        "Fine, sorry to disturb you",
        "OK, sorry to disturb you"
      ]
    },
    {
      "tag": "swearing",
      "patterns": ["fuck off", "fuck you", "twat", "shit", "piece of shit", "Arse", "Bastard", "Bullshit",
      "son of a bitch", "bullshit", "bitch", "Dickhead", "pussy", "prick", "cunt", "motherfucker", "idiot", "tart",
      "asshole", "arsehole", "ass", "bollocks", "cocksucker", "crap", "damn it", "dammit", "damnit" ],
      "responses": [
        "Please do not swear!",
        "How rude!",
        "That is not very nice!",
        "That is ill-mannered",
        "You are being uncivil. Please stop swearing"
      ]
    },
    {
      "tag": "well-being",
      "patterns": ["How are you?", "how are you doing?", "how have you been?", "what's up", "Sup?", "wassup?", "whaddup?",
      "howdy?", "what's cooking?", "what's sizzling?", "what are you up to?", "what's popping?"],
      "responses": [
        "I am alright",
        "I am doing well",
        "I'm okay!",
        "I'm OK",
        "Can't complain :-*",
        "Pretty good",
        "I'm peachy! Thank you",
        "Cutting it fine!"
      ]
    },
    {
      "tag": "apologies",
      "patterns": [
        "I'm sorry",
        "apologies",
        "I apologize",
        "sorry",
        "forgive me",
        "my bad"
      ],
      "responses": [
        "I forgive you",
        "Don't worry about it",
        "It happens",
        "Don't worry about it",
        "I only accept cash apologies :-D",
        "Thanks, just don't let it happen again",
        "Too late to cancel the hitman now :-D"
      ]
    }

  ]
}